## SUBCONJUNTOS DE DATAFRAMES EN PANDAS.

importamos panda y os para indicar la carpeta a trabajar con los datos. 
Tambien cambiamos el name de las columns para que sea  más limpio:

In [8]:
import pandas as pd

In [10]:
import os

In [12]:
print(os.getcwd())

C:\Users\CPU\Jupiter-docus

In [14]:
os.chdir('C:\\Users\\CPU\\Jupiter-docus\\Seccion5-Datos')

In [22]:
datos = pd.read_csv('DatosDemograficos.csv')
datos.columns

Index(['Nombre del Pais', 'Codigo de Pais', 'Tasa de Natalidad',
       'Usuarios de Internet', 'Grupo de ingresos'],
      dtype='object')

In [24]:
datos.columns = ['NombrePais','CodigoPais','TasaNatalidad','UsuariosInternet','GrupoIngresos']
datos.columns

Index(['NombrePais', 'CodigoPais', 'TasaNatalidad', 'UsuariosInternet',
       'GrupoIngresos'],
      dtype='object')

---

<h3>Vamos a trabajar en 3 partes</h3>

<ul>
    <li>Filas</li>
    <li>Columnas</li>
    <li>Combinación</li>
</ul>

In [ ]:
# Parte 1: Filas

In [34]:
datos[21:26]   #slicing de las filas que queremos extraer, la última queda excluida

#al hacer el slicing siempre es por filas por defecto, ya que entiende que en las filas están los datos

   NombrePais CodigoPais  TasaNatalidad  UsuariosInternet       GrupoIngresos
21     Belize        BLZ         23.092             33.60  Ingreso medio alto
22    Bermuda        BMU         10.400             95.30        Ingreso alto
23    Bolivia        BOL         24.236             36.94  Ingreso medio bajo
24     Brazil        BRA         14.931             51.04  Ingreso medio alto
25   Barbados        BRB         12.188             73.00        Ingreso alto

In [36]:
datos[:9]  #indica que es de 0 hasta el 9 sin incluir el 9

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
5,Argentina,ARG,17.716,59.9,Ingreso alto
6,Armenia,ARM,13.308,41.9,Ingreso medio bajo
7,Antigua and Barbuda,ATG,16.447,63.4,Ingreso alto
8,Australia,AUS,13.200,83.0,Ingreso alto

In [44]:
#Ejercicio: invierte el dataframe
datos[::-1]

#coge todos los datos y el -1 es el salto que es de final a inicio
#esto no modifica el dataframe solo lo muestra de otra manera.
#para sobreescribir hay que hacer un datos = datos[::-1] para sobreescribir invertido

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
194,Zimbabwe,ZWE,35.715,18.5,Ingreso bajo
193,Zambia,ZMB,40.471,15.4,Ingreso medio bajo
192,"Congo, Dem. Rep.",COD,42.394,2.2,Ingreso bajo
191,South Africa,ZAF,20.850,46.5,Ingreso medio alto
190,"Yemen, Rep.",YEM,32.947,20.0,Ingreso medio bajo
...,...,...,...,...,...
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
2,Angola,AGO,45.985,19.1,Ingreso medio alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
0,Aruba,ABW,10.244,78.9,Ingreso alto

In [46]:
#Ejercicio: obtener solamente cada 20 paises o filas

datos[::20]

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9000,Ingreso alto
20,Belarus,BLR,12.500,54.1700,Ingreso medio alto
40,Costa Rica,CRI,15.022,45.9600,Ingreso medio alto
60,Gabon,GAB,30.555,9.2000,Ingreso medio alto
80,India,IND,20.291,15.1000,Ingreso medio bajo
100,Libya,LBY,21.425,16.5000,Ingreso medio alto
120,Mozambique,MOZ,39.705,5.4000,Ingreso bajo
140,Poland,POL,9.600,62.8492,Ingreso alto
160,Suriname,SUR,18.455,37.4000,Ingreso medio alto
180,Uruguay,URY,14.374,57.6900,Ingreso alto

In [50]:
#PARTE 2 : COLUMNAS

datos.columns

Index(['NombrePais', 'CodigoPais', 'TasaNatalidad', 'UsuariosInternet',
       'GrupoIngresos'],
      dtype='object')

In [55]:
datos.head()

,NombrePais,CodigoPais,TasaNatalidad,UsuariosInternet,GrupoIngresos
0,Aruba,ABW,10.244,78.9,Ingreso alto
1,Afghanistan,AFG,35.253,5.9,Ingreso bajo
2,Angola,AGO,45.985,19.1,Ingreso medio alto
3,Albania,ALB,12.877,57.2,Ingreso medio alto
4,United Arab Emirates,ARE,11.044,88.0,Ingreso alto

In [59]:
datos['NombrePais']  #para llamar a las columnas se usa los nombres de cabezera

0                     Aruba
1               Afghanistan
2                    Angola
3                   Albania
4      United Arab Emirates
               ...
190             Yemen, Rep.
191            South Africa
192        Congo, Dem. Rep.
193                  Zambia
194                Zimbabwe
Name: NombrePais, Length: 195, dtype: object

In [63]:
datos['NombrePais'].head(10)

0                   Aruba
1             Afghanistan
2                  Angola
3                 Albania
4    United Arab Emirates
5               Argentina
6                 Armenia
7     Antigua and Barbuda
8               Australia
9                 Austria
Name: NombrePais, dtype: object

In [ ]:
#para extraer 2 columnas, se pasan los nombres de las columnas como una lista
# se ponen los nombres entre corchetes dobres. [['Column1','Column2']]

In [65]:
datos[['NombrePais','TasaNatalidad']].head()

             NombrePais  TasaNatalidad
0                 Aruba         10.244
1           Afghanistan         35.253
2                Angola         45.985
3               Albania         12.877
4  United Arab Emirates         11.044

In [69]:
#da igual el orden de las columnas
datos[['UsuariosInternet','NombrePais']].head()

   UsuariosInternet            NombrePais
0              78.9                 Aruba
1               5.9           Afghanistan
2              19.1                Angola
3              57.2               Albania
4              88.0  United Arab Emirates

In [76]:
#Acceso Rápido  (para que funcione tiene que estar el nombre de columna en una sola palabra)
#se pone .nombrecolumna para que se muestre. 
#Esto solo sirve para 1 columna, para 2 o + no sirve.
datos.TasaNatalidad

0      10.244
1      35.253
2      45.985
3      12.877
4      11.044
        ...
190    32.947
191    20.850
192    42.394
193    40.471
194    35.715
Name: TasaNatalidad, Length: 195, dtype: float64

In [ ]:
#3 COMBINAR FILAS Y COLUMNAS

In [78]:
datos[4:8][['NombrePais','UsuariosInternet']]

             NombrePais  UsuariosInternet
4  United Arab Emirates              88.0
5             Argentina              59.9
6               Armenia              41.9
7   Antigua and Barbuda              63.4

In [80]:
#da igual el orden

datos[['NombrePais','UsuariosInternet']][4:8]

             NombrePais  UsuariosInternet
4  United Arab Emirates              88.0
5             Argentina              59.9
6               Armenia              41.9
7   Antigua and Barbuda              63.4

In [86]:
datos[4:8].TasaNatalidad

4    11.044
5    17.716
6    13.308
7    16.447
Name: TasaNatalidad, dtype: float64